In [ ]:
#행,열 생성 및 수정하기

In [4]:
import pandas as pd

In [5]:
friend_dict_list = [{'name': 'John', 'age': 15, 'job': 'student'},
         {'name': 'jenny', 'age': 30, 'job': 'develper'},
         {'name': 'Nate', 'age': 30, 'job' : 'teacher'}]

In [6]:
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])

In [7]:
df.head()

    name  age       job
0   John   15   student
1  jenny   30  develper
2   Nate   30   teacher

In [8]:
df['salary'] = 0 #salary column(열) 추가

In [9]:
df.head()

    name  age       job  salary
0   John   15   student       0
1  jenny   30  develper       0
2   Nate   30   teacher       0

In [10]:
import numpy as np

In [ ]:
# job이 student면 salary가 없다(no), student가 아니면 있다(yes)로 표시

In [11]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [12]:
df.head()

    name  age       job salary
0   John   15   student     no
1  jenny   30  develper    yes
2   Nate   30   teacher    yes

In [13]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 30, 'final': 10 }]

In [14]:
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])

In [15]:
df.head()

    name  midterm  final
0   John       95     85
1  jenny       85     80
2   Nate       30     10

In [16]:
df['total'] = df['midterm'] + df['final']

In [17]:
df.head()

    name  midterm  final  total
0   John       95     85    180
1  jenny       85     80    165
2   Nate       30     10     40

In [18]:
df['average'] = df['total'] / 2

In [21]:
df.head()

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [24]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >=80:
        grades.append('B')
    else:
        grades.append('F')

In [25]:
df['grade'] = grades

In [27]:
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [28]:
def pass_or_fail(row):
    if row != 'F':
        return "Pass"
    else:
        return "Fail"

In [29]:
df.grade = df.grade.apply(pass_or_fail)

In [31]:
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [32]:
date_list = [
    {
        'yyyy-mm-dd : 2000-06-27'
    },
    {
        'yyyy-mm-dd : 2007-10-27'
    }
]

df = pd.DataFrame(date_list, columns=['yyyy-mm-dd'])

In [33]:
df.head()

                yyyy-mm-dd
0  yyyy-mm-dd : 2000-06-27
1  yyyy-mm-dd : 2007-10-27

In [34]:
def extract_year(row):
    return row.split('-')[0]

In [35]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [36]:
df.head()

                yyyy-mm-dd  year
0  yyyy-mm-dd : 2000-06-27  yyyy
1  yyyy-mm-dd : 2007-10-27  yyyy

In [37]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 30, 'final': 10 }]

In [38]:
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])

In [39]:
df.head()

    name  midterm  final
0   John       95     85
1  jenny       85     80
2   Nate       30     10

In [40]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns = ['name', 'midterm', 'final'])

In [41]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [43]:
df.append(df2, ignore_index = True)

    name  midterm  final
0   John       95     85
1  jenny       85     80
2   Nate       30     10
3    Ben       50     50